#2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
#
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
#
# Результат: [12, 44, 4, 10, 78, 123].
#
# Для чисел в пределах от 20 до 240 найти числа, кратные 20 или 21. Необходимо решить задание в одну строку.

# Подсказка: использовать функцию range() и генератор.

list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
new_list = [el for i, el in enumerate(list) if el[i] > el[i+1] and i != 0]
print(new_list)

new_list_2 = [el for el in range(20, 241, 1) if el % 20 == 0 or el % 21 == 0]
print(new_list_2)