#Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
#Примеры строк файла:
#
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря:
#
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

file = open('less5_task6.txt', "r")
dictionary = dict()
for line in file:
    list = line.split()
    hours = 0
    for i in range(1, len(list)):
        list_subject = list[i].split('(')
        f = list_subject[0]
        if f == '-': continue
        else: hours = hours + int(f)
    dictionary_subject = {list[0]: hours}
    dictionary.update(dictionary_subject)

print(dictionary)

file.close()
